zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h553xx.h
#define COMP_SR_C2VAL_Pos            (1U)
#define COMP_SR_C2VAL_Msk            (0x1UL << COMP_SR_C2VAL_Pos)          /*!< 0x00000002                            */
#define COMP_SR_C2VAL                COMP_SR_C2VAL_Msk

#define COMP_SR_C1IF_Pos             (16U)
#define COMP_SR_C1IF_Msk             (0x1UL << COMP_SR_C1IF_Pos)           /*!< 0x00010000                            */
#define COMP_SR_C1IF                 COMP_SR_C1IF_Msk

#define COMP_SR_C2IF_Pos             (17U)
#define COMP_SR_C2IF_Msk             (0x1UL << COMP_SR_C2IF_Pos)           /*!< 0x00020000                            */
#define COMP_SR_C2IF                 COMP_SR_C2IF_Msk

/**********************************     Bit definition for COMP_ICFR register *****************************************/
#define COMP_ICFR_CC1IF_Pos          (16U)
#define COMP_ICFR_CC1IF_Msk          (0x1UL << COMP_ICFR_CC1IF_Pos)        /*!< 0x00010000                            */
#define COMP_ICFR_CC1IF              COMP_ICFR_CC1IF_Msk

#define COMP_ICFR_CC2IF_Pos          (17U)
#define COMP_ICFR_CC2IF_Msk          (0x1UL << COMP_ICFR_CC2IF_Pos)        /*!< 0x00020000                            */
#define COMP_ICFR_CC2IF              COMP_ICFR_CC2IF_Msk

/**********************************      Bit definition for COMP_CFGR1 register  **************************************/
#define COMP_CFGR1_EN_Pos            (0U)
#define COMP_CFGR1_EN_Msk            (0x1UL << COMP_CFGR1_EN_Pos)          /*!< 0x00000001                            */
#define COMP_CFGR1_EN                COMP_CFGR1_EN_Msk                     /*!< COMP1 enable bit                      */

#define COMP_CFGR1_BRGEN_Pos         (1U)
#define COMP_CFGR1_BRGEN_Msk         (0x1UL << COMP_CFGR1_BRGEN_Pos)       /*!< 0x00000002                            */
#define COMP_CFGR1_BRGEN             COMP_CFGR1_BRGEN_Msk                  /*!< COMP1 Scaler bridge enable            */

#define COMP_CFGR1_SCALEN_Pos        (2U)
#define COMP_CFGR1_SCALEN_Msk        (0x1UL << COMP_CFGR1_SCALEN_Pos)      /*!< 0x00000004                            */
#define COMP_CFGR1_SCALEN            COMP_CFGR1_SCALEN_Msk                 /*!< COMP1 Voltage scaler enable bit       */

#define COMP_CFGR1_POLARITY_Pos      (3U)
#define COMP_CFGR1_POLARITY_Msk      (0x1UL << COMP_CFGR1_POLARITY_Pos)    /*!< 0x00000008                            */
#define COMP_CFGR1_POLARITY          COMP_CFGR1_POLARITY_Msk               /*!< COMP1 polarity selection bit          */

#define COMP_CFGR1_WINMODE_Pos       (4U)
#define COMP_CFGR1_WINMODE_Msk       (0x1UL << COMP_CFGR1_WINMODE_Pos)     /*!< 0x00000010 */
#define COMP_CFGR1_WINMODE           COMP_CFGR1_WINMODE_Msk                /*!< COMP1 window mode selection bit       */

#define COMP_CFGR1_ITEN_Pos          (6U)
#define COMP_CFGR1_ITEN_Msk          (0x1UL << COMP_CFGR1_ITEN_Pos)        /*!< 0x00000040                            */
#define COMP_CFGR1_ITEN              COMP_CFGR1_ITEN_Msk                   /*!< COMP1 interrupt enable                */

#define COMP_CFGR1_HYST_Pos          (8U)
#define COMP_CFGR1_HYST_Msk          (0x3UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000300                            */
#define COMP_CFGR1_HYST              COMP_CFGR1_HYST_Msk                   /*!< COMP1 hysteresis selection bits       */
#define COMP_CFGR1_HYST_0            (0x1UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000100                            */
#define COMP_CFGR1_HYST_1            (0x2UL << COMP_CFGR1_HYST_Pos)        /*!< 0x00000200                            */

#define COMP_CFGR1_PWRMODE_Pos       (12U)
#define COMP_CFGR1_PWRMODE_Msk       (0x3UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00003000                            */
#define COMP_CFGR1_PWRMODE           COMP_CFGR1_PWRMODE_Msk                /*!< COMP1 Power Mode of the comparator    */
#define COMP_CFGR1_PWRMODE_0         (0x1UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00001000                            */
#define COMP_CFGR1_PWRMODE_1         (0x2UL << COMP_CFGR1_PWRMODE_Pos)     /*!< 0x00002000                            */

#define COMP_CFGR1_WINOUT_Pos        (14U)
#define COMP_CFGR1_WINOUT_Msk        (0x1UL << COMP_CFGR1_WINOUT_Pos)      /*!< 0x00004000 */
#define COMP_CFGR1_WINOUT            COMP_CFGR1_WINOUT_Msk                 /*!< COMP1 window output selection bit     */

#define COMP_CFGR1_INMSEL_Pos        (16U)
#define COMP_CFGR1_INMSEL_Msk        (0xFUL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x000F0000                            */
#define COMP_CFGR1_INMSEL            COMP_CFGR1_INMSEL_Msk                 /*!< COMP1 input minus selection bit       */
#define COMP_CFGR1_INMSEL_0          (0x1UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00010000                            */
#define COMP_CFGR1_INMSEL_1          (0x2UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00020000                            */
#define COMP_CFGR1_INMSEL_2          (0x4UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00040000                            */
#define COMP_CFGR1_INMSEL_3          (0x8UL << COMP_CFGR1_INMSEL_Pos)      /*!< 0x00080000                            */

#define COMP_CFGR1_INPSEL_Pos        (20U)
#define COMP_CFGR1_INPSEL_Msk        (0x5UL << COMP_CFGR1_INPSEL_Pos)      /*!< 0x00500000                            */
#define COMP_CFGR1_INPSEL            COMP_CFGR1_INPSEL_Msk                 /*!< COMP1 input plus 0 selection bit      */

#define COMP_CFGR1_INPSEL0_Pos       (20U)
#define COMP_CFGR1_INPSEL0_Msk       (0x1UL << COMP_CFGR1_INPSEL0_Pos)     /*!< 0x00100000                            */
#define COMP_CFGR1_INPSEL0           COMP_CFGR1_INPSEL0_Msk                /*!< COMP1 input plus 0 selection bit      */

#define COMP_CFGR1_INPSEL1_Pos       (22U)
#define COMP_CFGR1_INPSEL1_Msk       (0x1UL << COMP_CFGR1_INPSEL1_Pos)     /*!< 0x00400000                            */
#define COMP_CFGR1_INPSEL1           COMP_CFGR1_INPSEL1_Msk                /*!< COMP1 input plus 1 selection bit      */

#define COMP_CFGR1_BLANKING_Pos      (24U)
#define COMP_CFGR1_BLANKING_Msk      (0xFUL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x0F000000                            */
#define COMP_CFGR1_BLANKING          COMP_CFGR1_BLANKING_Msk               /*!< COMP1 blanking source selection bits  */
#define COMP_CFGR1_BLANKING_0        (0x1UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x01000000                            */
#define COMP_CFGR1_BLANKING_1        (0x2UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x02000000                            */
#define COMP_CFGR1_BLANKING_2        (0x4UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x04000000                            */
#define COMP_CFGR1_BLANKING_3        (0x8UL << COMP_CFGR1_BLANKING_Pos)    /*!< 0x08000000                            */

#define COMP_CFGR1_LOCK_Pos          (31U)
#define COMP_CFGR1_LOCK_Msk          (0x1UL << COMP_CFGR1_LOCK_Pos)        /*!< 0x80000000                            */
#define COMP_CFGR1_LOCK              COMP_CFGR1_LOCK_Msk                   /*!< COMP1 Lock Bit                        */

/*********************************  Bit definition for COMP_CFGR2 register  *******************************************/
#define COMP_CFGR2_EN_Pos            (0U)
#define COMP_CFGR2_EN_Msk            (0x1UL << COMP_CFGR2_EN_Pos)          /*!< 0x00000001                            */
#define COMP_CFGR2_EN                COMP_CFGR2_EN_Msk                     /*!< COMP1 enable bit                      */

