zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h553xx.h
/******************  Bit definition for PLAY_SECCFGR register  ****************/
#define PLAY_SECCFGR_SEC_Pos            (0U)
#define PLAY_SECCFGR_SEC_Msk            (0x3UL << PLAY_SECCFGR_SEC_Pos)         /*!< 0x00000003 */
#define PLAY_SECCFGR_SEC                PLAY_SECCFGR_SEC_Msk                    /*!< Security configuration */
#define PLAY_SECCFGR_SEC_0              (0x1UL << PLAY_SECCFGR_SEC_Pos)         /*!< 0x00000001 */
#define PLAY_SECCFGR_SEC_1              (0x2UL << PLAY_SECCFGR_SEC_Pos)         /*!< 0x00000002 */

/******************  Bit definition for PLAY_PRIVCFGR register  ***************/
#define PLAY_PRIVCFGR_PRIV_Pos          (0U)
#define PLAY_PRIVCFGR_PRIV_Msk          (0x3UL << PLAY_PRIVCFGR_PRIV_Pos)       /*!< 0x00000003 */
#define PLAY_PRIVCFGR_PRIV              PLAY_PRIVCFGR_PRIV_Msk                  /*!< Privilege configuration */
#define PLAY_PRIVCFGR_PRIV_0            (0x1UL << PLAY_PRIVCFGR_PRIV_Pos)       /*!< 0x00000001 */
#define PLAY_PRIVCFGR_PRIV_1            (0x2UL << PLAY_PRIVCFGR_PRIV_Pos)       /*!< 0x00000002 */

/******************  Bit definition for PLAY_FILTxCFG register  ***************/
#define PLAY_FILTxCFG_WIDTH_Pos         (0U)
#define PLAY_FILTxCFG_WIDTH_Msk         (0xFFUL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x000000FF */
#define PLAY_FILTxCFG_WIDTH             PLAY_FILTxCFG_WIDTH_Msk                 /*!< Minimum Pulse Width */
#define PLAY_FILTxCFG_WIDTH_0           (0x01UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000001 */
#define PLAY_FILTxCFG_WIDTH_1           (0x02UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000002 */
#define PLAY_FILTxCFG_WIDTH_2           (0x04UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000004 */
#define PLAY_FILTxCFG_WIDTH_3           (0x08UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000008 */
#define PLAY_FILTxCFG_WIDTH_4           (0x10UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000010 */
#define PLAY_FILTxCFG_WIDTH_5           (0x20UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000020 */
#define PLAY_FILTxCFG_WIDTH_6           (0x40UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000040 */
#define PLAY_FILTxCFG_WIDTH_7           (0x80UL << PLAY_FILTxCFG_WIDTH_Pos)     /*!< 0x00000080 */

#define PLAY_FILTxCFG_EDGEDET_Pos       (8U)
#define PLAY_FILTxCFG_EDGEDET_Msk       (0x3UL << PLAY_FILTxCFG_EDGEDET_Pos)    /*!< 0x00000300 */
#define PLAY_FILTxCFG_EDGEDET           PLAY_FILTxCFG_EDGEDET_Msk               /*!< Edge Detection mode */
#define PLAY_FILTxCFG_EDGEDET_0         (0x1UL << PLAY_FILTxCFG_EDGEDET_Pos)    /*!< 0x00000100 */
#define PLAY_FILTxCFG_EDGEDET_1         (0x2UL << PLAY_FILTxCFG_EDGEDET_Pos)    /*!< 0x00000200 */

#define PLAY_FILTxCFG_PREMUXSEL_Pos     (16U)
#define PLAY_FILTxCFG_PREMUXSEL_Msk     (0x07UL << PLAY_FILTxCFG_PREMUXSEL_Pos) /*!< 0x00070000 */
#define PLAY_FILTxCFG_PREMUXSEL         PLAY_FILTxCFG_PREMUXSEL_Msk             /*!< Input Pre-Multiplexer Selection */
#define PLAY_FILTxCFG_PREMUXSEL_0       (0x1UL << PLAY_FILTxCFG_PREMUXSEL_Pos)  /*!< 0x00001000 */
#define PLAY_FILTxCFG_PREMUXSEL_1       (0x2UL << PLAY_FILTxCFG_PREMUXSEL_Pos)  /*!< 0x00002000 */
#define PLAY_FILTxCFG_PREMUXSEL_2       (0x4UL << PLAY_FILTxCFG_PREMUXSEL_Pos)  /*!< 0x00004000 */

/******************  Bit definition for PLAY_LExCFG1 register  ****************/
#define PLAY_LExCFG1_LUT_Pos            (0U)
#define PLAY_LExCFG1_LUT_Msk            (0xFFFFUL << PLAY_LExCFG1_LUT_Pos)      /*!< 0x0000FFFF */
#define PLAY_LExCFG1_LUT                PLAY_LExCFG1_LUT_Msk                    /*!< Look-Up Table contents */

/******************  Bit definition for PLAY_LExCFG2 register  ****************/
#define PLAY_LExCFG2_IN0_SEL_Pos        (0U)
#define PLAY_LExCFG2_IN0_SEL_Msk        (0x3FUL << PLAY_LExCFG2_IN0_SEL_Pos)    /*!< 0x0000003F */
#define PLAY_LExCFG2_IN0_SEL            PLAY_LExCFG2_IN0_SEL_Msk                /*!< Logic Element Input 0 */

#define PLAY_LExCFG2_IN1_SEL_Pos        (6U)
#define PLAY_LExCFG2_IN1_SEL_Msk        (0x3FUL << PLAY_LExCFG2_IN1_SEL_Pos)    /*!< 0x00000FC0 */
#define PLAY_LExCFG2_IN1_SEL            PLAY_LExCFG2_IN1_SEL_Msk                /*!< Logic Element Input 1 */

#define PLAY_LExCFG2_IN2_SEL_Pos        (12U)
#define PLAY_LExCFG2_IN2_SEL_Msk        (0x3FUL << PLAY_LExCFG2_IN2_SEL_Pos)    /*!< 0x00003F00 */
#define PLAY_LExCFG2_IN2_SEL            PLAY_LExCFG2_IN2_SEL_Msk                /*!< Logic Element Input 2 */

#define PLAY_LExCFG2_IN3_SEL_Pos        (18U)
#define PLAY_LExCFG2_IN3_SEL_Msk        (0x3FUL << PLAY_LExCFG2_IN3_SEL_Pos)    /*!< 0x000FC000 */
#define PLAY_LExCFG2_IN3_SEL            PLAY_LExCFG2_IN3_SEL_Msk                /*!< Logic Element Input 3 */

#define PLAY_LExCFG2_CK_SEL_Pos         (24U)
#define PLAY_LExCFG2_CK_SEL_Msk         (0x3FUL << PLAY_LExCFG2_CK_SEL_Pos)     /*!< 0x3F000000 */
#define PLAY_LExCFG2_CK_SEL             PLAY_LExCFG2_CK_SEL_Msk                 /*!< Clock Enable Selection */

/******************  Bit definition for PLAY_OUTxCFG register  ****************/
#define PLAY_OUTxCFG_SEL_Pos            (0U)
#define PLAY_OUTxCFG_SEL_Msk            (0x1FUL << PLAY_OUTxCFG_SEL_Pos)        /*!< 0x0000001F */
#define PLAY_OUTxCFG_SEL                PLAY_OUTxCFG_SEL_Msk                    /*!< Output source Selection */

/******************  Bit definition for PLAY_SWIN register  *******************/
#define PLAY_SWIN_SWIN0_Pos             (0U)
#define PLAY_SWIN_SWIN0_Msk             (0x01UL << PLAY_SWIN_SWIN0_Pos)         /*!< 0x00000001 */
#define PLAY_SWIN_SWIN0                 PLAY_SWIN_SWIN0_Msk                     /*!< Input SWIN0 state */

#define PLAY_SWIN_SWIN1_Pos             (1U)
#define PLAY_SWIN_SWIN1_Msk             (0x01UL << PLAY_SWIN_SWIN1_Pos)         /*!< 0x00000002 */
#define PLAY_SWIN_SWIN1                 PLAY_SWIN_SWIN1_Msk                     /*!< Input SWIN1 state */

#define PLAY_SWIN_SWIN2_Pos             (2U)
#define PLAY_SWIN_SWIN2_Msk             (0x01UL << PLAY_SWIN_SWIN2_Pos)         /*!< 0x00000004 */
#define PLAY_SWIN_SWIN2                 PLAY_SWIN_SWIN2_Msk                     /*!< Input SWIN2 state */

#define PLAY_SWIN_SWIN3_Pos             (3U)
#define PLAY_SWIN_SWIN3_Msk             (0x01UL << PLAY_SWIN_SWIN3_Pos)         /*!< 0x00000008 */
#define PLAY_SWIN_SWIN3                 PLAY_SWIN_SWIN3_Msk                     /*!< Input SWIN3 state */

