zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h553xx.h
#define PLAY_FLSET_FLAGR_SET15_Pos      (31U)
#define PLAY_FLSET_FLAGR_SET15_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET15_Pos)  /*!< 0x80000000 */
#define PLAY_FLSET_FLAGR_SET15          PLAY_FLSET_FLAGR_SET15_Msk              /*!< Flag Output Register 15 */

/******************  Bit definition for PLAY_FLCLR register  ******************/
#define PLAY_FLCLR_FLAGD_CLR0_Pos       (0U)
#define PLAY_FLCLR_FLAGD_CLR0_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR0_Pos)   /*!< 0x00000001 */
#define PLAY_FLCLR_FLAGD_CLR0           PLAY_FLCLR_FLAGD_CLR0_Msk               /*!< Flag Output Direct0 */

#define PLAY_FLCLR_FLAGD_CLR1_Pos       (1U)
#define PLAY_FLCLR_FLAGD_CLR1_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR1_Pos)   /*!< 0x00000002 */
#define PLAY_FLCLR_FLAGD_CLR1           PLAY_FLCLR_FLAGD_CLR1_Msk               /*!< Flag Output Direct1 */

#define PLAY_FLCLR_FLAGD_CLR2_Pos       (2U)
#define PLAY_FLCLR_FLAGD_CLR2_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR2_Pos)   /*!< 0x00000004 */
#define PLAY_FLCLR_FLAGD_CLR2           PLAY_FLCLR_FLAGD_CLR2_Msk               /*!< Flag Output Direct2 */

#define PLAY_FLCLR_FLAGD_CLR3_Pos       (3U)
#define PLAY_FLCLR_FLAGD_CLR3_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR3_Pos)   /*!< 0x00000008 */
#define PLAY_FLCLR_FLAGD_CLR3           PLAY_FLCLR_FLAGD_CLR3_Msk               /*!< Flag Output Direct3 */

#define PLAY_FLCLR_FLAGD_CLR4_Pos       (4U)
#define PLAY_FLCLR_FLAGD_CLR4_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR4_Pos)   /*!< 0x00000010 */
#define PLAY_FLCLR_FLAGD_CLR4           PLAY_FLCLR_FLAGD_CLR4_Msk               /*!< Flag Output Direct4 */

#define PLAY_FLCLR_FLAGD_CLR5_Pos       (5U)
#define PLAY_FLCLR_FLAGD_CLR5_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR5_Pos)   /*!< 0x00000020 */
#define PLAY_FLCLR_FLAGD_CLR5           PLAY_FLCLR_FLAGD_CLR5_Msk               /*!< Flag Output Direct5 */

#define PLAY_FLCLR_FLAGD_CLR6_Pos       (6U)
#define PLAY_FLCLR_FLAGD_CLR6_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR6_Pos)   /*!< 0x00000040 */
#define PLAY_FLCLR_FLAGD_CLR6           PLAY_FLCLR_FLAGD_CLR6_Msk               /*!< Flag Output Direct6 */

#define PLAY_FLCLR_FLAGD_CLR7_Pos       (7U)
#define PLAY_FLCLR_FLAGD_CLR7_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR7_Pos)   /*!< 0x00000080 */
#define PLAY_FLCLR_FLAGD_CLR7           PLAY_FLCLR_FLAGD_CLR7_Msk               /*!< Flag Output Direct7 */

#define PLAY_FLCLR_FLAGD_CLR8_Pos       (8U)
#define PLAY_FLCLR_FLAGD_CLR8_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR8_Pos)   /*!< 0x00000100 */
#define PLAY_FLCLR_FLAGD_CLR8           PLAY_FLCLR_FLAGD_CLR8_Msk               /*!< Flag Output Direct8 */

#define PLAY_FLCLR_FLAGD_CLR9_Pos       (9U)
#define PLAY_FLCLR_FLAGD_CLR9_Msk       (0x01UL << PLAY_FLCLR_FLAGD_CLR9_Pos)   /*!< 0x00000200 */
#define PLAY_FLCLR_FLAGD_CLR9           PLAY_FLCLR_FLAGD_CLR9_Msk               /*!< Flag Output Direct9 */

#define PLAY_FLCLR_FLAGD_CLR10_Pos      (10U)
#define PLAY_FLCLR_FLAGD_CLR10_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR10_Pos)  /*!< 0x00000400 */
#define PLAY_FLCLR_FLAGD_CLR10          PLAY_FLCLR_FLAGD_CLR10_Msk              /*!< Flag Output Direct10 */

#define PLAY_FLCLR_FLAGD_CLR11_Pos      (11U)
#define PLAY_FLCLR_FLAGD_CLR11_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR11_Pos)  /*!< 0x00000800 */
#define PLAY_FLCLR_FLAGD_CLR11          PLAY_FLCLR_FLAGD_CLR11_Msk              /*!< Flag Output Direct11 */

#define PLAY_FLCLR_FLAGD_CLR12_Pos      (12U)
#define PLAY_FLCLR_FLAGD_CLR12_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR12_Pos)  /*!< 0x00001000 */
#define PLAY_FLCLR_FLAGD_CLR12          PLAY_FLCLR_FLAGD_CLR12_Msk              /*!< Flag Output Direct12 */

#define PLAY_FLCLR_FLAGD_CLR13_Pos      (13U)
#define PLAY_FLCLR_FLAGD_CLR13_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR13_Pos)  /*!< 0x00002000 */
#define PLAY_FLCLR_FLAGD_CLR13          PLAY_FLCLR_FLAGD_CLR13_Msk              /*!< Flag Output Direct13 */

#define PLAY_FLCLR_FLAGD_CLR14_Pos      (14U)
#define PLAY_FLCLR_FLAGD_CLR14_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR14_Pos)  /*!< 0x00004000 */
#define PLAY_FLCLR_FLAGD_CLR14          PLAY_FLCLR_FLAGD_CLR14_Msk              /*!< Flag Output Direct14 */

#define PLAY_FLCLR_FLAGD_CLR15_Pos      (15U)
#define PLAY_FLCLR_FLAGD_CLR15_Msk      (0x01UL << PLAY_FLCLR_FLAGD_CLR15_Pos)  /*!< 0x00008000 */
#define PLAY_FLCLR_FLAGD_CLR15          PLAY_FLCLR_FLAGD_CLR15_Msk              /*!< Flag Output Direct15 */

#define PLAY_FLCLR_FLAGR_CLR0_Pos       (16U)
#define PLAY_FLCLR_FLAGR_CLR0_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR0_Pos)   /*!< 0x00010000 */
#define PLAY_FLCLR_FLAGR_CLR0           PLAY_FLCLR_FLAGR_CLR0_Msk               /*!< Flag Output Register 0 */

#define PLAY_FLCLR_FLAGR_CLR1_Pos       (17U)
#define PLAY_FLCLR_FLAGR_CLR1_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR1_Pos)   /*!< 0x00020000 */
#define PLAY_FLCLR_FLAGR_CLR1           PLAY_FLCLR_FLAGR_CLR1_Msk               /*!< Flag Output Register 1 */

#define PLAY_FLCLR_FLAGR_CLR2_Pos       (18U)
#define PLAY_FLCLR_FLAGR_CLR2_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR2_Pos)   /*!< 0x00040000 */
#define PLAY_FLCLR_FLAGR_CLR2           PLAY_FLCLR_FLAGR_CLR2_Msk               /*!< Flag Output Register 2 */

#define PLAY_FLCLR_FLAGR_CLR3_Pos       (19U)
#define PLAY_FLCLR_FLAGR_CLR3_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR3_Pos)   /*!< 0x00080000 */
#define PLAY_FLCLR_FLAGR_CLR3           PLAY_FLCLR_FLAGR_CLR3_Msk               /*!< Flag Output Register 3 */

#define PLAY_FLCLR_FLAGR_CLR4_Pos       (20U)
#define PLAY_FLCLR_FLAGR_CLR4_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR4_Pos)   /*!< 0x00100000 */
#define PLAY_FLCLR_FLAGR_CLR4           PLAY_FLCLR_FLAGR_CLR4_Msk               /*!< Flag Output Register 4 */

#define PLAY_FLCLR_FLAGR_CLR5_Pos       (21U)
#define PLAY_FLCLR_FLAGR_CLR5_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR5_Pos)   /*!< 0x00200000 */
#define PLAY_FLCLR_FLAGR_CLR5           PLAY_FLCLR_FLAGR_CLR5_Msk               /*!< Flag Output Register 5 */

#define PLAY_FLCLR_FLAGR_CLR6_Pos       (22U)
#define PLAY_FLCLR_FLAGR_CLR6_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR6_Pos)   /*!< 0x00400000 */
#define PLAY_FLCLR_FLAGR_CLR6           PLAY_FLCLR_FLAGR_CLR6_Msk               /*!< Flag Output Register 6 */

#define PLAY_FLCLR_FLAGR_CLR7_Pos       (23U)
#define PLAY_FLCLR_FLAGR_CLR7_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR7_Pos)   /*!< 0x00800000 */
#define PLAY_FLCLR_FLAGR_CLR7           PLAY_FLCLR_FLAGR_CLR7_Msk               /*!< Flag Output Register 7 */

#define PLAY_FLCLR_FLAGR_CLR8_Pos       (24U)
#define PLAY_FLCLR_FLAGR_CLR8_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR8_Pos)   /*!< 0x01000000 */
#define PLAY_FLCLR_FLAGR_CLR8           PLAY_FLCLR_FLAGR_CLR8_Msk               /*!< Flag Output Register 8 */

#define PLAY_FLCLR_FLAGR_CLR9_Pos       (25U)
#define PLAY_FLCLR_FLAGR_CLR9_Msk       (0x01UL << PLAY_FLCLR_FLAGR_CLR9_Pos)   /*!< 0x02000000 */
#define PLAY_FLCLR_FLAGR_CLR9           PLAY_FLCLR_FLAGR_CLR9_Msk               /*!< Flag Output Register 9 */

#define PLAY_FLCLR_FLAGR_CLR10_Pos      (26U)
#define PLAY_FLCLR_FLAGR_CLR10_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR10_Pos)  /*!< 0x04000000 */
#define PLAY_FLCLR_FLAGR_CLR10          PLAY_FLCLR_FLAGR_CLR10_Msk              /*!< Flag Output Register 10 */

#define PLAY_FLCLR_FLAGR_CLR11_Pos      (27U)
#define PLAY_FLCLR_FLAGR_CLR11_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR11_Pos)  /*!< 0x08000000 */
#define PLAY_FLCLR_FLAGR_CLR11          PLAY_FLCLR_FLAGR_CLR11_Msk              /*!< Flag Output Register 11 */

