zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h553xx.h
#define PLAY_FLCLR_FLAGR_CLR12_Pos      (28U)
#define PLAY_FLCLR_FLAGR_CLR12_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR12_Pos)  /*!< 0x10000000 */
#define PLAY_FLCLR_FLAGR_CLR12          PLAY_FLCLR_FLAGR_CLR12_Msk              /*!< Flag Output Register 12 */

#define PLAY_FLCLR_FLAGR_CLR13_Pos      (29U)
#define PLAY_FLCLR_FLAGR_CLR13_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR13_Pos)  /*!< 0x20000000 */
#define PLAY_FLCLR_FLAGR_CLR13          PLAY_FLCLR_FLAGR_CLR13_Msk              /*!< Flag Output Register 13 */

#define PLAY_FLCLR_FLAGR_CLR14_Pos      (30U)
#define PLAY_FLCLR_FLAGR_CLR14_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR14_Pos)  /*!< 0x40000000 */
#define PLAY_FLCLR_FLAGR_CLR14          PLAY_FLCLR_FLAGR_CLR14_Msk              /*!< Flag Output Register 14 */

#define PLAY_FLCLR_FLAGR_CLR15_Pos      (31U)
#define PLAY_FLCLR_FLAGR_CLR15_Msk      (0x01UL << PLAY_FLCLR_FLAGR_CLR15_Pos)  /*!< 0x80000000 */
#define PLAY_FLCLR_FLAGR_CLR15          PLAY_FLCLR_FLAGR_CLR15_Msk              /*!< Flag Output Register 15 */

/******************  Bit definition for PLAY_FLIER register  ******************/
#define PLAY_FLIER_FLAGD_IEN0_Pos       (0U)
#define PLAY_FLIER_FLAGD_IEN0_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN0_Pos)   /*!< 0x00000001 */
#define PLAY_FLIER_FLAGD_IEN0           PLAY_FLIER_FLAGD_IEN0_Msk               /*!< Flag Interrupt Output Direct0 */

#define PLAY_FLIER_FLAGD_IEN1_Pos       (1U)
#define PLAY_FLIER_FLAGD_IEN1_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN1_Pos)   /*!< 0x00000002 */
#define PLAY_FLIER_FLAGD_IEN1           PLAY_FLIER_FLAGD_IEN1_Msk               /*!< Flag Interrupt Output Direct1 */

#define PLAY_FLIER_FLAGD_IEN2_Pos       (2U)
#define PLAY_FLIER_FLAGD_IEN2_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN2_Pos)   /*!< 0x00000004 */
#define PLAY_FLIER_FLAGD_IEN2           PLAY_FLIER_FLAGD_IEN2_Msk               /*!< Flag Interrupt Output Direct2 */

#define PLAY_FLIER_FLAGD_IEN3_Pos       (3U)
#define PLAY_FLIER_FLAGD_IEN3_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN3_Pos)   /*!< 0x00000008 */
#define PLAY_FLIER_FLAGD_IEN3           PLAY_FLIER_FLAGD_IEN3_Msk               /*!< Flag Interrupt Output Direct3 */

#define PLAY_FLIER_FLAGD_IEN4_Pos       (4U)
#define PLAY_FLIER_FLAGD_IEN4_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN4_Pos)   /*!< 0x00000010 */
#define PLAY_FLIER_FLAGD_IEN4           PLAY_FLIER_FLAGD_IEN4_Msk               /*!< Flag Interrupt Output Direct4 */

#define PLAY_FLIER_FLAGD_IEN5_Pos       (5U)
#define PLAY_FLIER_FLAGD_IEN5_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN5_Pos)   /*!< 0x00000020 */
#define PLAY_FLIER_FLAGD_IEN5           PLAY_FLIER_FLAGD_IEN5_Msk               /*!< Flag Interrupt Output Direct5 */

#define PLAY_FLIER_FLAGD_IEN6_Pos       (6U)
#define PLAY_FLIER_FLAGD_IEN6_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN6_Pos)   /*!< 0x00000040 */
#define PLAY_FLIER_FLAGD_IEN6           PLAY_FLIER_FLAGD_IEN6_Msk               /*!< Flag Interrupt Output Direct6 */

#define PLAY_FLIER_FLAGD_IEN7_Pos       (7U)
#define PLAY_FLIER_FLAGD_IEN7_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN7_Pos)   /*!< 0x00000080 */
#define PLAY_FLIER_FLAGD_IEN7           PLAY_FLIER_FLAGD_IEN7_Msk               /*!< Flag Interrupt Output Direct7 */

#define PLAY_FLIER_FLAGD_IEN8_Pos       (8U)
#define PLAY_FLIER_FLAGD_IEN8_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN8_Pos)   /*!< 0x00000100 */
#define PLAY_FLIER_FLAGD_IEN8           PLAY_FLIER_FLAGD_IEN8_Msk               /*!< Flag Interrupt Output Direct8 */

#define PLAY_FLIER_FLAGD_IEN9_Pos       (9U)
#define PLAY_FLIER_FLAGD_IEN9_Msk       (0x01UL << PLAY_FLIER_FLAGD_IEN9_Pos)   /*!< 0x00000200 */
#define PLAY_FLIER_FLAGD_IEN9           PLAY_FLIER_FLAGD_IEN9_Msk               /*!< Flag Interrupt Output Direct9 */

#define PLAY_FLIER_FLAGD_IEN10_Pos      (10U)
#define PLAY_FLIER_FLAGD_IEN10_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN10_Pos)  /*!< 0x00000400 */
#define PLAY_FLIER_FLAGD_IEN10          PLAY_FLIER_FLAGD_IEN10_Msk              /*!< Flag Interrupt Output Direct10 */

#define PLAY_FLIER_FLAGD_IEN11_Pos      (11U)
#define PLAY_FLIER_FLAGD_IEN11_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN11_Pos)  /*!< 0x00000800 */
#define PLAY_FLIER_FLAGD_IEN11          PLAY_FLIER_FLAGD_IEN11_Msk              /*!< Flag Interrupt Output Direct11 */

#define PLAY_FLIER_FLAGD_IEN12_Pos      (12U)
#define PLAY_FLIER_FLAGD_IEN12_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN12_Pos)  /*!< 0x00001000 */
#define PLAY_FLIER_FLAGD_IEN12          PLAY_FLIER_FLAGD_IEN12_Msk              /*!< Flag Interrupt Output Direct12 */

#define PLAY_FLIER_FLAGD_IEN13_Pos      (13U)
#define PLAY_FLIER_FLAGD_IEN13_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN13_Pos)  /*!< 0x00002000 */
#define PLAY_FLIER_FLAGD_IEN13          PLAY_FLIER_FLAGD_IEN13_Msk              /*!< Flag Interrupt Output Direct13 */

#define PLAY_FLIER_FLAGD_IEN14_Pos      (14U)
#define PLAY_FLIER_FLAGD_IEN14_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN14_Pos)  /*!< 0x00004000 */
#define PLAY_FLIER_FLAGD_IEN14          PLAY_FLIER_FLAGD_IEN14_Msk              /*!< Flag Interrupt Output Direct14 */

#define PLAY_FLIER_FLAGD_IEN15_Pos      (15U)
#define PLAY_FLIER_FLAGD_IEN15_Msk      (0x01UL << PLAY_FLIER_FLAGD_IEN15_Pos)  /*!< 0x00008000 */
#define PLAY_FLIER_FLAGD_IEN15          PLAY_FLIER_FLAGD_IEN15_Msk              /*!< Flag Interrupt Output Direct15 */

#define PLAY_FLIER_FLAGR_IEN0_Pos       (16U)
#define PLAY_FLIER_FLAGR_IEN0_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN0_Pos)   /*!< 0x00010000 */
#define PLAY_FLIER_FLAGR_IEN0           PLAY_FLIER_FLAGR_IEN0_Msk               /*!< Flag Interrupt Output Register 0 */

#define PLAY_FLIER_FLAGR_IEN1_Pos       (17U)
#define PLAY_FLIER_FLAGR_IEN1_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN1_Pos)   /*!< 0x00020000 */
#define PLAY_FLIER_FLAGR_IEN1           PLAY_FLIER_FLAGR_IEN1_Msk               /*!< Flag Interrupt Output Register 1 */

#define PLAY_FLIER_FLAGR_IEN2_Pos       (18U)
#define PLAY_FLIER_FLAGR_IEN2_Msk       (0x01UL << PLAY_FLIER_FLAGR_IEN2_Pos)   /*!< 0x00040000 */
#define PLAY_FLIER_FLAGR_IEN2           PLAY_FLIER_FLAGR_IEN2_Msk               /*!< Flag Interrupt Output Register 2 */

